let GeoIPDB_FULL = _GetWatchlist("geoip");
let WindowsEvents = SecurityEvent
| where IpAddress == <attacker IP address>
| where EventID == 4625
| order by TimeGenerated desc
| evaluate ipv4_lookup(GeoIPDB_FULL, IpAddress, network)
WindowsEvents

SecurityEvent
| where EventID == "4625"

SecurityEvent
| project TimeGenerated, Computer, IpAddress, cityname, countryname, latitude, longitude

let GeoIPDB_FULL = _GetWatchlist("geoip");
let WindowsEvents = SecurityEvent
| where IpAddress == "165.73.163.209"
| where EventID == 4625
| order by TimeGenerated desc
| evaluate ipv4_lookup(GeoIPDB_FULL, IpAddress, network)
WindowsEvents
| project TimeGenerated, Computer, IpAddress, cityname, countryname, latitude, longitude
